[datamodel2index2sourcetype]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * *
description = Builds the list of datamodels and sourcetypes
dispatch.earliest_time = -7
dispatch.latest_time = now
enableSched = 1
schedule_window = 120
search = | tstats values(sourcetype) as sourcetype WHERE index=* by index\
| mvexpand sourcetype\
| join type=left sourcetype  [\
| datamodel\
| rex field=_raw "\"modelName\"\s*\:\s*\"(?<modelName>[^\"]+)\""\
| search NOT modelName IN (Splunk_CIM_Validation) AND NOT modelName=Identity_Management\
| fields modelName\
| table modelName\
| map maxsearches=60 search="tstats count from datamodel=\"$modelName$\" by sourcetype | eval modelName=\"$modelName$\"" | fields - count | rename modelName as datamodel\
]\
| table datamodel index sourcetype\
\
| outputlookup DM2index2Sourcetype.csv
